using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;

namespace Recipe.Models
{
    public class DB
    {
        public static List<User> UserList { get; set; }
        public static List<Recipes> RecipeList { get; set; }

        public static List<Category> CategoryList { get; set; }

        static DB()
        {
            UserList = new List<User>()
            {
                new User(){UserCode=111111111,UserName="miri",UserAddress="avfdgf",UserMail="miri@gmail.com",UserPassword="m1111"},
                new User(){UserCode=222222222,UserName="hoshen",UserAddress="bbbbb",UserMail="hoshen@gmail.com",UserPassword="h2222"},
                new User(){UserCode=333333333,UserName="michal",UserAddress="ccccc",UserMail="michal@gmail.com",UserPassword="m3333"}
            };

            RecipeList = new List<Recipes>()
            {
                new Recipes()
                {
                    RecipeCode = "1111",
                    RecipeName = "עוגת שוקולד חד קרן מהחלומות",
                    CategoryCode = "1",
                    RecipePreparationTime = 150,
                    RecipeLevel = "4",
                    RecipeAdd = new DateTime(),
                    RecipeIngredients = new List<string>() { "4 ביצים L",
"1 ו-1/4 כוסות (250 מ”ל) שמן",
"2 מיכלים (500 מ”ל) שמנת מתוקה או קרם קוקוס",
"1 ו-1/2 כוסות (300 גרם) סוכר לבן",
"10 כפות גדושות (100 גרם) קקאו איכותי",
"2 כוסות (280 גרם) קמח לבן",
"1 שקית (10 גרם) אבקת אפייה",
"1/2 צנצנת נוטלה או שוקולד השחר",
"תוספת שאוהבים: שברי מקופלת או קליק או תותים או פטל",
"100 גרם חמאה רכה, בטמפרטורת החדר (לא מומסת)",
"1 ו-3/4 כוסות אבקת סוכר",
"1/2 מיכל (125 מ”ל) שמנת מתוקה",
"מעט צבע מאכל ורוד או אדום – לא חובה",
"100 גרם שוקולד מריר או חלב",
"1/2 מיכל (125 מ”ל) שמנת מתוקה",
"1 כף שמן",
"1 ביצת קינדר",
"עדשים צבעוניות",
"עלי זהב",
"מקרונים מוכנים (רוכשים בקונדיטוריות)",
"בובת חד קרן וקשת צבעונית ",
"סוכריות צבעוניות" },

RecipePreparationWay = new List<string>() {
 " – בקערת מיקסר עם וו הקצפה, או בקערה גדולה רגילה, שמים את כל מצרכי העוגה פרט לקמח, לאבקת האפייה ולקקאו. טורפים היטב.",
"– מנפים פנימה קמח, קקאו (חשוב חשוב לפנות אחרת יהיו לכם גושי קקאו) ואבקת אפייה וטורפים רק עד שהקקאו והקמח נבלעים בבלילה ולא יותר.",
"– מעבירים לתבנית בקוטר 22 או 20 (ב-20 יצא גבוה יותר) משומנת ואופים בתנור שחומם מראש ל-165 מעלות במשך 40-50 דקות. מאוד תלוי בגודל התבנית שבחרתם. בכל מקרה מומלץ לבדוק עם שיטת הקיסם כבר אחרי 35 דקות. מצננים לגמרי לפני שממשיכים לשלב הבא (אני פשוט מעבירה את העוגה אחרי רבע שעה למקרר).",
"– בקערת מיקסר עם וו הקצפה שמים את החמאה, הסוכר והשמנת המתוקה ומקציפים עד שנוצר קרן תפוח ולבן מאוד. זה לוקח בערך 8 דקות אז סבלנות. מקפידים להוריד את הקרן מדפנות הקערה מדי פעם.",
"– אם רוצים, מוסיפים כמה שניות לסוף את צבע המאכל ומקציפים עוד דקה.",
"– כשהעוגה קרה, ובמידה ונוצר לה כיפה למעלה, מיישרים אותה עם סכין ארוכה ומשוננת כמו של לחם.",
"– פורסים את העוגה באמצע, כמו שחותכים לחמנייה, ומורחים על החלק התחתון ממרח שוקולד בנדיבות. מעטרים בשברי מקופלת, קליק, תותים, פטל, דובדבני אמרנה או כל תוספת אחרת שאוהבים. בהערות למטה כתבתי לכם איזה עוד ממרחים אפשר לשים.",
"– סוגרים את העועה עם החצי השני ומצמידים היטב.",
"– בעזרת פלטה מדורגת (אפשר לרכוש פה) או סכין ישרה יחסית, מורחים את שולי העוגה מסביב בקרם. בגלל שהעוגה מכוסה בסוכריות לא חייבים שהציפוי יהיה חלק אלא רק שיעטוף את העוגה. את שאריות הקרם מעבירים לשקית זילוף עם צנתר משונן.",
"– על תבנית בגודל של טוסטר אובן בערך או מגש שיש לו קצת שוליים, מפזרים המון סוכריות צבעוניות.",
"– מגלגלים את העוגה בתוך הסוכריות, כשהדפנות עם הקרם מופנות כלפי הסוכריות כשמדי פעם מפזרים שוב את הסוכריות על המגש בשכבה אחידה.",
"– הופכים את העוגה כשהחלק הישר כלפי מטה ומזלפים תלוליות קרם חמאה בצדדים כמו פרחים יפים. מצננים במקרר עד שמכינים את רוטב השוקולד.",
"– בקערה שמתאימה למיקרו שמים שוקולד מריר, שמן ושמנת וממיסים עד שנוצר רוטב שוקולד מבריק. ממתינים 5-10 דקות כדי שיצטנן מעט ומעבירים לשקית זילוף. חותכים למטה פתח קטן.",
"– מזלפים נטיפי שוקולד בחלק העליון של העוגה כך שהם ירדו למטה וממלאים את החלק העליון בשוקולד מסביב לתלוליות הקרם.",
"– מעטרים עם חצאי ביצי קינדר שממלאים בעדשים צבעוניות, בבובת חד קרן וקשת בענן ובכל ממתק אחר שאוהבים. וכמובן, דפי זהב אכילים."
},
UserCode = "111111111",
RecipeRoutImage="./assets/עוגת חד קרן.jpg",
RecipeIsShow=true
},
new Recipes()
{
 RecipeCode = "2222",
 RecipeName = "עוגת שוקולד עם סוכריות צבעוניות",
CategoryCode = "1",
RecipePreparationTime = 45,
RecipeLevel = "3",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
    "לעוגה:",
"4 ביצים L, בטמפרטורת החדר",
"200 גרם (1 כוס) סוכר",
"קורט מלח",
"200 גרם שוקולד מריר",
"150 גרם חמאה (ר' הערות לגרסה פרווה)",
"140 גרם (1 כוס) קמח או קורנפלור",
"1 כפית אבקת אפייה",
"לציפוי שוקולד:",
"150 גרם שוקולד מריר",
"125 מ'ל (1/2 כוס) שמנת מתוקה (ר' הערות לגרסה פרווה)",
"לקישוט:",
"סוכריות עדשים צבעוניות"
},
RecipePreparationWay = new List<string>() {
   "- מחממים תנור ל-180 מעלות ומשמנים את התבנית.",
"-בקערת מיקסר שמים ביצים, סוכר ומלח ומקציפים במהירות גבוהה במשך 4-5 דקות עד שמתקבלת תערובת תפוחה, אוורירית ובהירה.",
"-בקערה נפרדת שמים שוקולד וחמאה וממסים יחד במיקרוגל או על סיר אדים כפול עד שהכל נמס.",
"-מוסיפים את תערובת השוקולד המומס לתוך קציפת הביצים ומקפלים בעדינות כמעט עד שאחיד.",
"-מוסיפים קמח ואבקת אפייה ומקפלים עד שמתקבלת בלילה אחידה ואין גושי קמח.",
"-יוצקים את הבלילה לתוך התבנית ואופים במשך 35-45 דקות או עד שהעוגה תפוחה, מתייצבת וקיסם הננעץ במרכזה יוצא עם פירורים לחים.",
"-מצננים בטמפרטורת החדר.",
"-ציפוי שוקולד: קוצצים את השוקולד ושמים בקערה. מוסיפים שמנת וממסים יחד במיקרוגל או על סיר אדים כפול עד שהכל נמס והתערובת אחידה.",
"-יוצקים את הציפוי על גבי העוגה ומיישרים.",
"-מקררים את העוגה במשך 3-4 שעות במקרר להתייצבות מוחלטת של הציפוי.",
"-חותכים את העוגה ל-6 פרוסות (או לפי כמות הצבעים של העדשים) ומקשטים כל פרוסה בעדשים בצבע אחיד."
},
UserCode = "222222222",
RecipeRoutImage="../assets/עוגת שוקולד עם סוכריות צבעוניות.jpg",
RecipeIsShow=true
                },
new Recipes{
RecipeCode = "3333",
 RecipeName = "עוגת יום הולדת מקושטת עם בצק סוכר",
CategoryCode = "1",
RecipePreparationTime = 105,
RecipeLevel = "2",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
 "1 עוגת שוקולד מוכנה בקוטר 20 ס״מ",
"שתי כפות גנאש מוכן",
"לציפוי:",
"1 חבילה בצק סוכר כחול",
"2 חבילות בצק סוכר לבן",
 " לסוכריות הצבעוניות:",
"10 גרם בצק סוכר אדום",
"10 גרם בצק סוכר צהוב",
"10 גרם בצק סוכר ורוד",
"לקישוט נוסף:",
"אבקת זהב אכילה",
"נר"
}
            ,
RecipePreparationWay = new List<string>() {
   "- מחממים תנור ל-180 מעלות ומשמנים את התבנית.",
"-בקערת מיקסר שמים ביצים, סוכר ומלח ומקציפים במהירות גבוהה במשך 4-5 דקות עד שמתקבלת תערובת תפוחה, אוורירית ובהירה.",
"-בקערה נפרדת שמים שוקולד וחמאה וממסים יחד במיקרוגל או על סיר אדים כפול עד שהכל נמס.",
"-מוסיפים את תערובת השוקולד המומס לתוך קציפת הביצים ומקפלים בעדינות כמעט עד שאחיד.",
"-מוסיפים קמח ואבקת אפייה ומקפלים עד שמתקבלת בלילה אחידה ואין גושי קמח.",
"-יוצקים את הבלילה לתוך התבנית ואופים במשך 35-45 דקות או עד שהעוגה תפוחה, מתייצבת וקיסם הננעץ במרכזה יוצא עם פירורים לחים.",
"-מצננים בטמפרטורת החדר.",
"-ציפוי שוקולד: קוצצים את השוקולד ושמים בקערה. מוסיפים שמנת וממסים יחד במיקרוגל או על סיר אדים כפול עד שהכל נמס והתערובת אחידה.",
"-יוצקים את הציפוי על גבי העוגה ומיישרים.",
"-מקררים את העוגה במשך 3-4 שעות במקרר להתייצבות מוחלטת של הציפוי.",
"-חותכים את העוגה ל-6 פרוסות (או לפי כמות הצבעים של העדשים) ומקשטים כל פרוסה בעדשים בצבע אחיד."
},
UserCode = "111111111",
RecipeRoutImage="../assets/עוגת-יום-הולדת-מקושטת-עם-בצק-סוכר.jpg",
RecipeIsShow=true
                } ,
           
            new Recipes{
RecipeCode = "4444",
 RecipeName = "עוגת מיקי מאוס",
CategoryCode = "1",
RecipePreparationTime = 25,
RecipeLevel = "1",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
"לעוגות שוקולד",
"4 ביצים",
"300 גרם סוכר לבן (1 ו-1/2 כוסות)",
"250 מ'ל שמן (1 ו-1/4 כוסות)",
"250 מ'ל שמנת מתוקה (1 מיכל)",
"200 מ'ל שמנת חמוצה (1 מיכל)",
"120 מ'ל חלב (1/2 כוס)",
"100 גרם קקאו איכותי (1/2 כוס)",
"280 גרם קמח תופח (2 כוסות)",
"לרוטב שוקולד (גאנש)",
"130 גרם שוקולד מריר (או חלב)",
"125 מ'ל שמנת מתוקה (1/2 מיכל)",
"לקישוט",
"7 חבילות כיף כף",
"3 חבילות כדורי קליק",
"סוכריות צבעוניות"
}
,RecipePreparationWay = new List<string>() {
"- בקערה גדולה שמים את כל מצרכי העוגה וטורפים היטב עד שהקמח נטמע. מעבירים לתבנית עגולה, משומנת, בגודל 22 ואת שאר הבלילה מעבירים ל-2 תבניות בקוטר 5 או 8 או 2 שקעים של מאפינס אבל מהגדולים יותר. חשוב רק שהבלילה תגיע לאותו גובה פחות או יותר.",
"- אופים בתנור שחומם מראש ל-170 מעלות במשך 30 דקות לתבניות הקטנות ו-45 דקות לתבנית הגדולה. אבל תבדקו לקראת הסוף שהעוגות יציבות וקיסם המוחדר למרכז העוגה יוצא עם פירורים לחים.",
"- מכינים רוטב שוקולד (גאנש): שוברים את השוקולד לקוביות ושופכים מעליו את השמנת. ממיסים ביחד במיקרו ומערבבים מדי פעם עד שנוצר רוטב שוקולד מבריק. מצננים במשך 10-15 דקות.",
"- מרכיבים: מיישרים את העוגות עם סכין לחם (אם הכנתם בתבנית מאפינס רק תיישרו את הצדדים שיראה כמו עיגול ישר) והופכים אותן לצד השני כדי שהצד החלק והישר יהיה למעלה.",
"- מורחים מעט מהגאנש שוקולד מעל העוגות ואת השאר מורחים על דפנות העוגה (מסביב). זה בסדר אם זה לא ישר, לא יראו את זה.",
"- מצמידים את 2 העוגות הקטנות לעוגה הגדולה למעלה בצדדים, כמו בתמונה, ומתחילים לקשט.",
"- חותכים את הכיף כף לחצי ומדביקים מסביב לעוגה כשהצד החתוך כלפי מטה.",
"- מניחים כדורי קליק בהיקף העוגה למעלה ומפזרים באמצע סוכריות."
},
UserCode = "333333333",
RecipeRoutImage="../assets/עוגת מיקי מאוס.jpg",
RecipeIsShow=true
                },
new Recipes{
RecipeCode = "5555",
 RecipeName = "אלפחורס",
CategoryCode = "2",
RecipePreparationTime = 30,
RecipeLevel = "4",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
   " בצק אלפחורס",
"200גרם חמאה רכה",
"200 גרם או 2שקיות אבקת סוכר",
"3חלמונים L",
"1 חבילה או 80גרם אינסטנט פודינג בטעם וניל",
"200 גרם או 1 1/2כוסות קורנפלור",
"200 גרם או 1 1/2כוסות קמח לבן",
"2כפיות אבקת אפייה",
"1/2כפית אבקת סודה לשתייה",
"מלית",
"ריבת חלב",
"ציפוי",
"שבבי קוקוס"
} ,
RecipePreparationWay = new List<string>() {
"-בצק אלפחורס: מעבדים חמאה ואבקת סוכר במיקסר עם וו גיטרה לתערובת חלקה ואוורירית. מוסיפים חלמונים ומעבדים, עד שהתערובת אחידה.",
"-מנפים יחד את שאר החומרים, מוסיפים לתערובת ומעבדים רק עד לבצק אחיד. יוצרים כדור, עוטפים בניילון נצמד ומעבירים למקרר לשעתיים.",
"-מחממים תנור ל-170 מעלות.",
"-מרדדים את הבצק לעלה בעובי 1/2 ס”מ וקורצים לעיגולים בקוטר 5 ס”מ.",
"-מניחים באופן מרווח על תבנית מרופדת בנייר אפייה ואופים 10-12 דקות, עד שהעוגיות מתחילות להזהיב בשוליים ועדיין בהירות במרכז. מצננים לחלוטין.",
"-מילוי: מורחים כפית ריבת חלב על חצי מכמות העוגיות. מצמידים להן עוגייה ריקה, ליצירת סנדוויץ’ עוגיות אלפחורס. לוחצים מעט את העוגיות, כדי שהריבה תציץ מהשוליים (אם אוהבים הרבה ריבה, אפשר למרוח על כל הדפנות).",
"-מגלגלים את העוגיות בקוקוס.",
"-לא טועמים מיד - העוגיות משתבחות מאוד כעבור יום."
},
UserCode = "333333333",
RecipeRoutImage="../assets/אלפחורס.jpg",
RecipeIsShow=true
                },
            new Recipes{
RecipeCode = "6666",
 RecipeName = "ביס ביסקוטי בננה",
CategoryCode = "2",
RecipePreparationTime = 20,
RecipeLevel = "1",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
     "עוגיות",
"2 כוסות או 280גרם קמח לבן",
"1כפית אבקת סודה לשתייה",
"1ביצה L",
"1/2 כוס או 100גרם סוכר לבן",
"1בננה בינוני",
"1כפית תמצית וניל",
"תוספות (לא חובה)",
"1/3 כוס או 30גרם אגוזי לוז",
"50גרם שוקולד מריר"
}
,RecipePreparationWay = new List<string>() {
"-מחממים תנור ל-180 מעלות.",
"-בקערה מערבבים קמח עם אבקת סודה לשתייה. מוסיפים ביצה, סוכר, מחית בננה ותמצית וניל ומערבבים בעזרת כף רק עד לקבלת בצק אחיד ודביק מאוד. מערבבים פנימה אגוזי לוז ושברי שוקולד.",
"-מפזרים קמח בנדיבות על משטח העבודה. בעזרת כף מניחים רבע מהבצק הדביק על הקמח ומגלגלים אותו לקימוח מכל הכיוונים. " ,
"-מגלגלים את הבצק לגליל צר (קוטר 2-3 ס”מ) באורך 35 ס”מ בערך, ומניחים על תבנית מרופדת בנייר אפייה." ,
"- הגליל יהיה מצופה קמח וזה בסדר. חוזרים על הפעולה עם יתרת הבצק (לקבלת 4 גלילים) ומקמחים לפי הצורך.",
"-אופים 15-20 דקות, עד שהגלילים תפוחים, זהובים ויציבים אך עדיין רכים ללחיצה. מצננים לחלוטין (חשוב! אחרת יהיה קשה לפרוס והמאפה יתפורר).",
"-מחממים תנור ל-130 מעלות.",
"-פורסים כל כיכר אפויה לפרוסות בעובי 1 ס”מ (ישר או באלכסון). מחזירים לייבוש בתנור במשך כ-25-35 דקות, עד שהעוגיות יבשות למגע. מצננים לחלוטין ומגישים. שומרים בכלי אטום בטמפ’ החדר."
},
UserCode = "222222222",
RecipeRoutImage="../assets/ביס ביסקוטי בננה.jpg",
RecipeIsShow=true
                },
            new Recipes{
RecipeCode = "7777",
 RecipeName = "עוגיות חמאה ודבש עם הפתעה",
CategoryCode = "2",
RecipePreparationTime = 35,
RecipeLevel = "3",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
    "עוגיות",
"1כוס אגוזי מלך",
"1כוס קמח לבן",
"1קורט מלח דק",
"1כפית תמצית וניל",
"2כפות שטוחות סוכר לבן",
"100גרם חמאה קרה",
"1כף דבש",
"הפתעות",
"אגוזי לוז",
"10קוביות שוקולד מריר",
"קישוט",
"אבקת סוכר"
}
,RecipePreparationWay = new List<string>() {
"-מחממים תנור ל-160 מעלות. חותכים למאה לקוביות.",
"-במעבד מזון טוחנים את האגוזים עם 2 כפות מהקמח לקבלת פירורים דקים.",
"-מוסיפים את יתרת הקמח, מלח, וניל, סוכר וחמאה ומעבדים בלחיצות קצרות לתערובת פירורית.",
"-מוסיפים דבש ומעבדים רק עד לקבלת בצק אחיד.",
"-מגלגלים את הבצק לכדורים, משטחים כל כדור ל”פיתה”, מניחים אגוז לוז מצופה שוקולד או חתיכת חטיף שוקולד, עוטפים בבצק ומגלגלים מחדש לכדור עם הפתעה.",
"-מניחים על תבנית מרופדת בנייר אפייה.",
"-אופים 20 דקות, עד שהעוגיות מתחילות להזהיב (גם בתחתית).",
"-מצננים לחלוטין לפני שמגישים (העוגיות מתפרקות כשהן חמות).",
"-מפזרים אבקת סוכר מעל לקישוט ומגישים. שומרים בכלי אטום בטמפרטורת החדר."
},
UserCode = "111111111",
RecipeRoutImage="../assets/עוגיות חמאה ודבש עם הפתעה.png",
RecipeIsShow=true
                },
new Recipes{
RecipeCode = "8888",
 RecipeName = "עוגיות טחינה משומשום מלא",
CategoryCode = "2",
RecipePreparationTime = 10,
RecipeLevel = "1",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
" 1/2 כוס טחינה 100% שומשום מלא",
"100 גרם חמאה  רכה",
"1/2 כוס סוכר",
"1/2 1 כוסות קמח כוסמין מלא",
"1 כפית אבקת אפייה",
"לקישוט:",
"שקד קלוף – לא חובה"
}
,RecipePreparationWay = new List<string>() {
"-מחממים תנור ל - 180 מעלות בתוכנית טורבו.",
"-בקערה גדולה מערבבים את כל הרכיבים עד לקבלת תערובת אחידה.",
"-יוצרים מבצק העוגיות עיגולים שווים ומעבירים לתבנית תנור מרופדת בנייר אפייה.",
"-אם רוצים אפשר להוסיף שקד קלוף וללחוץ מעט פנימה לכל עוגייה.",
"-מעבירים לתנור ואופים כ – 13-17 דקות או עד שהעוגיות משתטחות מעט, נסדקות ומשחימות בצדדים."
},
UserCode = "111111111",
RecipeRoutImage="../assets/עוגיות טחינה משומשום מלא.jpg",
RecipeIsShow=true
                },
            new Recipes{
RecipeCode = "9999",
 RecipeName = "עוגת לימון",
CategoryCode = "3",
RecipePreparationTime = 25,
RecipeLevel = "2",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
"2 ביצים",
"חצי כוס (100 ג') סוכר",
"שליש (66 ג') כוס שמן",
"כפית (5 ג') תמצית וניל",
"5 כפות (50 מ'ל) מיץ לימון טרי",
"שליש כוס (80 מ'ל) מים",
"2 כפות שטוחות גרידת לימון (קליפה של לימון בינוני מגורדת דק)",
"כוס (140 ג') קמח רגיל",
"כפית מלאה (6 ג') אבקת אפיה",
"3 כפות (21 ג') קוקוס" } ,
RecipePreparationWay = new List<string>() {
"-מחממים תנור ל180 מעלות ומשמנים תבנית אינגליש קייק.",
"-מערבבים בעזרת כף/מטרפה ביצים עם סוכר. מוסיפים שמן, תמצית וניל, מיץ לימון טרי, מים, גרידת לימון ומערבבים.",
"-מערבבים בקערית נפרדת את הקמח, אבקת האפיה והקוקוס ומוסיפים לתערובת. מערבבים קלות עד לאיחוד החומרים (הערה: ערבוב יתר לאחר הוספת הקמח עלול לפגוע במרקם העוגה ולגרום לה להיות דחוסה).",
"-יוצקים את הבלילה לתבנית ואופים במשך כ-30 דקות, עד שקיסם יוצא יבש."
},
UserCode = "333333333",
RecipeRoutImage="../assets/עוגת לימון.jpg",
RecipeIsShow=true},
new Recipes{
RecipeCode = "1010",
 RecipeName = "עוגת גבינה",
CategoryCode = "3",
RecipePreparationTime = 40,
RecipeLevel = "3",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
 " בסיס עוגת גבינה פירורים",
"2כוסות או 280גרם קמח לבן",
"2כפיות אבקת אפייה",
"1/3כוס או 70גרם סוכר לבן",
"1שקית סוכר וניל",
"200גרם חמאה קרה",
"4חלמונים L",
"מלית גבינה",
"2 מיכלים או 500מ'ל שמנת מתוקה 38%",
"1כוס או 200גרם סוכר לבן",
"1חבילה אינסטנט פודינג בטעם וניל",
"1גביע או 200מ'ל שמנת חמוצה 15%",
"500 גרם גבינה לבנה 5%"
},
RecipePreparationWay = new List<string>() {
" מחממים תנור ל-180 מעלות.",
"במעבד מזון מעבדים קמח, אבקת אפייה, 1/3 כוס סוכר, סוכר וניל וקוביות חמאה לתערובת פירורית. מוסיפים חלמונים ומעבדים בלחיצות קצרות (פולסים) רק עד לקבלת בצק פירורי.",
"לתחתית - משמנים את תבנית העוגה. מהדקים בידיים מחצית מהבצק בשכבה אחידה לתחתית התבנית.",
"לפירורים - משטחים את החצי הנותר של הבצק בתבנית נפרדת, מרופדת בנייר אפייה (גודל התבנית לא משנה).",
"מכניסים את שתי התבניות לתנור ואופים כ-20 דקות, עד להזהבה. מצננים לגמרי.",
"מלית עוגת גבינה פירורים: במיקסר מקציפים שמנת מתוקה, כוס סוכר, אינסטנט פודינג ושמנת חמוצה עד לקבלת קרם יציב.",
"מנמיכים את מהירות המיקסר, מוסיפים גבינה ומקציפים עוד כמה שניות לאיחוד.",
"משטחים את תערובת הגבינה בתבנית העוגה, מעל התחתית האפויה.",
"מפוררים בידיים את יתרת הבצק האפוי, לקבלת פירורים. מפזרים בעדינות את הפירורים מעל מלית הגבינה.",
"מעבירים למקרר ל-4 שעות לפחות, להתייצבות.",
"פורסים בסכין טבולה במים רותחים ומגישים."},
UserCode = "333333333",
RecipeRoutImage="../assets/עוגת-גבינה-פרורים-פרוסה.jpg",
RecipeIsShow=true }
,new Recipes{
RecipeCode = "1100",
 RecipeName = "עוגת שיש",
CategoryCode = "3",
RecipePreparationTime = 20,
RecipeLevel = "2",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
" לבסיס העוגה הבחושה",
"200 גרם חמאה רכה חתוכה לקוביות",
"250 גרם סוכר (כוס ורבע)",
"3 ביצים גודל L בטמפרטורת החדר",
"כפית תמצית וניל",
"350 גרם קמח לבן (2.5 כוסות)",
"2 כפיות אבקת אפיה אפשר להחליף לקמח תופח ולוותר על אבקת האפיה",
"כפית סודה לשתיה",
"מיכל שמנת חמוצה 200 מ'ל",
"1/2 כפית מלח",
"לשיש שוקולד",
"150 גרם שוקולד מריר",
"2 כפות חלב"
},
RecipePreparationWay = new List<string>() {
"ממיסים במיקרו את השוקולד עם 2 כפות חלב בפולסים של חצי דקה ומניחים בצד.",
"בקערת המיקסר עם וו גיטרה מערבלים את החמאה, הסוכר ותמצית הוניל עד לקבלת תערובת קרמית ורכה",
"מוסיפים הביצים, אחת אחת ומערבלים היטב בין כל הוספה.",
"מוסיפים את הקמח+אבקת אפיה+סודה לשתיה+מלח ואת השמנת החמוצה לסירוגין - מוסיפים שליש מכמות הקמח ומערבלים מעט," ,
" מוסיפים חצי מכמות השמנת ומערבלים מעט וחוזר חלילה עד שמסיימים ומתקבלת תערובת חלקה וללא גושי קמח.",
" שימו לב שלא לערבל יתר על המידה.",
"להכנת תערובת שיש השוקולד - מקפלים לתערובת השוקולד רבע מכמות תערובת העוגה.",
"מרכיבים את העוגה: מניחים בתבנית שכבה דקה של תערובת העוגה הלבנה." ,
" מעליה שורה של תערובת השוקולד ומעליהן עוד שכבת וניל ושכבת שוקולד. שימו לב שגובה הבלילות לא יעבור את 2/3 גובה התבנית.",
"בעזרת סכין או קיסם יוצרים דוגמת שיש: מערבבים בין התערובות עם הסכין לאורך התבנית בתנועת ספירלה לאחר מכן הופכים את התבנית וחוזרים על הערבוב לאותו כיוון.",
"אופים את העוגות במשך כ- 30 דקות עד שהעוגות שחומות מלמעלה וקיסם שננעץ במרכז העוגה יוצא עם פירורים יבשים עליו."
},
UserCode = "222222222",
RecipeRoutImage="../assets/עוגת שיש.jpg",
RecipeIsShow=true
},
new Recipes{
RecipeCode = "1212",
 RecipeName = "עוגת שוקולד",
CategoryCode = "3",
RecipePreparationTime = 35,
RecipeLevel = "3",
RecipeAdd = new DateTime(),
RecipeIngredients = new List<string>() {
"150 גרם סוכר חום בהיר",
"225 גרם חמאת תנובה רכה",
"4 ביצים מופרדות",
"200 גרם שוקולד מריר של כרמית טחון גס",
"230 גרם שקדים טחונים דק דק",
"2.5 כפות אבקת סוכר",
"2 כפות שבבי שקדים",
"1 מיכל שמנת מתוקה 38% או 32% שף הלבן תנובה",
"100 גרם שוקולד מריר של כרמית"
}
,RecipePreparationWay = new List<string>() {
"מקציפים במיקסר את החמאה הרכה + הסוכר החום.",
" מוסיפים את החלמונים בהדרגה + שוקולד שטחון גס + שקדים.",
" מקציפים בנפרד חלבונים ומוסיפים את אבקת הסוכר.",
" מקפלים לתערובת השוקולד.",
" אופים 50 דק' ב-170 מעלות.",
" מצפים ב-100 גר' השוקולד שהומס בסיר עם חצי ממיכל שמנת."
},
UserCode = "222222222",
RecipeRoutImage="../assets/עוגת שוקולד.jpg",
RecipeIsShow=true
                }
            };

            CategoryList = new List<Category>()
            {
                new Category(){CategoryCode="1",CategoryName="cakes",CategoryRoutIcon="./images/der.jpg"},
                new Category(){CategoryCode="2",CategoryName="salads",CategoryRoutIcon="./images/uiuyg.jpg"}
            };

        }

    }
}